{
    "metadata": {
        "total_size": 26960145024
    },
    "weight_map": {
        "transformer.wte.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.0.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.1.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.2.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.3.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.4.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.5.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.6.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.7.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.c_attn.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.c_attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.masked_bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.attn.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.ln_1.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.ln_1.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.ln_2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.ln_2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_fc.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_fc.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_fc2.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_fc2.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_proj.weight": "pytorch_model-00001-of-00004.bin",
        "transformer.h.8.mlp.c_proj.bias": "pytorch_model-00001-of-00004.bin",
        "transformer.h.9.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.9.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.10.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.11.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.12.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.13.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.14.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.15.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.16.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.17.mlp.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.c_attn.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.c_attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.masked_bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.c_proj.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.attn.c_proj.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.ln_1.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.ln_1.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.ln_2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.ln_2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.mlp.c_fc.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.mlp.c_fc.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.mlp.c_fc2.weight": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.mlp.c_fc2.bias": "pytorch_model-00002-of-00004.bin",
        "transformer.h.18.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.18.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.19.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.20.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.21.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.22.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.23.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.24.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.25.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.26.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_fc2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_fc2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.27.mlp.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.c_attn.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.c_attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.masked_bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.c_proj.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.attn.c_proj.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.ln_1.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.ln_1.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.ln_2.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.ln_2.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.mlp.c_fc.weight": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.mlp.c_fc.bias": "pytorch_model-00003-of-00004.bin",
        "transformer.h.28.mlp.c_fc2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.28.mlp.c_fc2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.28.mlp.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.28.mlp.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.c_attn.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.c_attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.masked_bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.attn.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.ln_1.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.ln_1.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.ln_2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.ln_2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_fc.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_fc.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_fc2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_fc2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.29.mlp.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.c_attn.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.c_attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.masked_bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.attn.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.ln_1.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.ln_1.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.ln_2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.ln_2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_fc.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_fc.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_fc2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_fc2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.30.mlp.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.c_attn.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.c_attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.masked_bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.attn.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.ln_1.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.ln_1.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.ln_2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.ln_2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_fc.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_fc.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_fc2.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_fc2.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_proj.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.h.31.mlp.c_proj.bias": "pytorch_model-00004-of-00004.bin",
        "transformer.ln_f.weight": "pytorch_model-00004-of-00004.bin",
        "transformer.ln_f.bias": "pytorch_model-00004-of-00004.bin",
        "lm_head.weight": "pytorch_model-00004-of-00004.bin"
    }
}